# CurveByPointsArrayIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPointsArrayIterator Class
Members See Also
---
An iterator to a CurveByPoints array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class CurveByPointsArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class CurveByPointsArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class CurveByPointsArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..CurveByPointsArrayIterator
# See Also
CurveByPointsArrayIterator Members
Autodesk.Revit.DB Namespace